<template>
    <el-container>
        <el-main class="infoMain">
            <h1>{{ title }}</h1>
            <p style="max-width: 600px">{{ text }}</p>
        </el-main>
    </el-container>
</template>

<script>
    export default {
        data() {
            return {
                title: 'Тестовое задание',
                text: 'Анимирование переходов между состояниями Система анимирования переходов Vue предоставляет много простых методов для анимации появления и исчезновения элементов и списков, но как насчёт анимации самих данных ? Например :  чисел и арифметических выражений отображаемых цветов позиции SVG-элементов размеров и прочих свойств элементов Все эти параметры либо хранятся как числа, либо могут быть сконвертированы в числа.Это значит, что мы можем использовать сторонние библиотеки для анимации, в сочетании с компонентными и реактивными системами Vue.'
            }
        }
    }
</script>